# Module 2 Assignment 1

### Exercise 1: Create a title using a Markdown Cell

- Add the title "Exploring Jupyter Notebook Features" and format the title to be a Level 1 heading (# Heading).

# TODO

### Exercise 2: Add an Introduction using Markdown

Add a Markdown cell with the following text:

In this notebook, we will:
- Create and manipulate a pandas DataFrame
- Perform operations with numpy arrays
- Practice using Markdown, Code, and Raw cells

# TODO

### Exercise 3: Insert a Code Cell to create a pandas DataFrame

- Use this dictionary to create a Pndas dataframe and then show the dataframe in the next cell.

```python
data = {
    "Product": ["Phone", "Laptop", "Tablet"],
    "Price": [699, 1200, 450],
    "Stock": [50, 30, 20],
}

In [ ]:
# TODO

In [ ]:
# TODO

  Product  Price  Stock
0   Phone    699     50
1  Laptop   1200     30
2  Tablet    450     20

### Exercise 4: Add a Code Cell to perform the following operations with Numpy

- Create a numpy array
[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

- Calculate the sum of elements

- Print array and sum

In [ ]:
# TODO

Array:
[[1 2 3]
 [4 5 6]
 [7 8 9]]
Sum of all elements: 45

### Exercise 5: Create a Series

- Import the Pandas library and create a Series object with the following data: ['apple', 'banana', 'cherry', 'date']. 
- Print the Series.

In [ ]:
# TODO

0     apple
1    banana
2    cherry
3      date
dtype: object

### Exercise 6: Create a DataFrame from a CSV file

- Load 'netherlands_IT_salaries.xlsx' file into a Pandas DataFrame and answer the following questions (file in Datasets folder on Microsoft Teams):
    - Print the number of rows and columns in the DataFrame.
    - Create and print a list of column names.
    - Display the first five rows of the DataFrame.
    - Display the last five rows of the DataFrame.

In [ ]:
# TODO

Number of rows: 1134
Number of columns: 7
Column names: ['Year', 'Age', 'Role', 'City', 'Education', 'Experience', 'Salary']

In [ ]:
# TODO

   Year  Age                 Role       City Education  Experience  Salary
0  2018   47      Helpdeskmanager  Apeldoorn       HBO        25.0  4950.0
1  2018   42  Applicatiebeheerder     Almelo      HAVO        10.0  4086.0
2  2018   42        BI Consultant        NaN       MBO        25.0  4400.0
3  2018   39    Software Engineer  Amsterdam       MBO         6.0  3600.0
4  2018   38        IT Consultant     Mierlo       HBO        15.0  4900.0

In [ ]:
# TODO

      Year  Age                  Role      City Education  Experience  Salary
1129  2021   23        Data Scientist  Randstad        WO         0.0  3750.0
1130  2021   23  System Administrator    Arnhem       MBO         0.0  2375.0
1131  2021   22     Software Engineer   Hengelo       HBO         0.0  2850.0
1132  2021   22     Software Engineer    Arnhem       HBO         0.0  2500.0
1133  2021   21     Software Engineer     Breda       MBO         1.0  2385.0

### Exercise 7: Explore the Data

- Do the following operations on the dataframe:
    - Display the summary statistics of the DataFrame. (DataFrame method)
    - Display the data types of the DataFrame. (DataFrame attribute)
    - Display the number of non-null values in each column. (DataFrame method)
    - Display the unique values in the 'Education' column. (Series method)
    - Display the number of unique values in the 'Education' column. (Series method)
    - Display the number of unique values in the DataFrame. (DataFrame method)

In [ ]:
# TODO

              Year          Age   Experience        Salary
count  1134.000000  1134.000000  1130.000000   1101.000000
mean   2019.586420    29.182540     5.519469   3511.183470
std       0.899657     5.098952     4.959899   1282.149202
min    2018.000000    18.000000     0.000000      2.000000
25%    2019.000000    25.000000     2.000000   2650.000000
50%    2020.000000    28.000000     4.000000   3250.000000
75%    2020.000000    32.000000     8.000000   4100.000000
max    2021.000000    53.000000    30.000000  11137.000000

In [ ]:
# TODO

Year            int64
Age             int64
Role           object
City           object
Education      object
Experience    float64
Salary        float64
dtype: object

In [ ]:
# TODO

Year          1134
Age           1134
Role          1134
City           877
Education     1070
Experience    1130
Salary        1101
dtype: int64

In [ ]:
# TODO

171

In [ ]:
# TODO

array(['HBO', 'HAVO', 'MBO', 'WO', nan, 'HIO', 'VWO', 'Mavo', 'MBOo 3',
       'VMBO', 'Havo', 'HBO, WO', 'B', 'ul', 'IT'], dtype=object)

In [ ]:
# TODO

14

In [ ]:
# TODO

Year            4
Age            36
Role          171
City          136
Education      14
Experience     27
Salary        390
dtype: int64

In [ ]:
# TODO

Year            4
Age            36
Role          171
City          136
Education      14
Experience     27
Salary        390
dtype: int64

## Methods for Series and DataFrame

- You should already noticed that some methods are only available for Series, while others are only available for DataFrames. 

  For example, the nunique() method is only available for Series, while the describe() method is only available for DataFrames. 

- But there are also some methods that are available for both Series and DataFrames. 

  For example, the unique() method is available for both Series and DataFrames.

### Exercise 8: More Attributes and Methods of Sries and Dataframe

- Try to learn more about the attributes and methods of Series and DataFrame object which can be used to explore the data and try to apply some of them to the DataFrame you have already created from the given file.
- Use them and create markdown cells to explain what they are for.

In [ ]:
# TODO